CadastrarAtualizarOperacaoTransporte.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tms="http://tmsfrete.v2.targetmp.com.br"
                  xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
                  xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <tms:CadastrarAtualizarOperacaoTransporte>
            <tms:auth>
                <tms:Usuario>tms.sankhya2</tms:Usuario>
                <tms:Senha>123@Mudar</tms:Senha>
                <tms:Token></tms:Token>
            </tms:auth>
            <tms:operacao>
                <tms:Instrucao>1</tms:Instrucao>
                <tms:IdOperacaoTransporte i:nil="true"/>
                <tms:CodigoCentroDeCusto></tms:CodigoCentroDeCusto>
                <tms:NCM>2302</tms:NCM>
                <tms:ProprietarioCarga>1</tms:ProprietarioCarga>
                <tms:PesoCarga>31600.0</tms:PesoCarga>
                <tms:TipoOperacao>1</tms:TipoOperacao>
                <tms:MunicipioOrigemCodigoIBGE>3545308</tms:MunicipioOrigemCodigoIBGE>
                <tms:MunicipioDestinoCodigoIBGE>3128402</tms:MunicipioDestinoCodigoIBGE>
                <tms:DataHoraInicio>2021-02-11</tms:DataHoraInicio>
                <tms:DataHoraTermino>2021-02-12</tms:DataHoraTermino>
                <tms:CPFCNPJContratado>06647297626</tms:CPFCNPJContratado>
                <tms:ValorFrete>376.0</tms:ValorFrete>
                <tms:ValorCombustivel>0.0</tms:ValorCombustivel>
                <tms:ValorPedagio>0.0</tms:ValorPedagio>
                <tms:ValorDespesas>0.0</tms:ValorDespesas>
                <tms:ValorImpostoSestSenat>1.88</tms:ValorImpostoSestSenat>
                <tms:ValorImpostoIRRF>0.0</tms:ValorImpostoIRRF>
                <tms:ValorImpostoINSS>8.27</tms:ValorImpostoINSS>
                <tms:ValorImpostoIcmsIssqn>0.0</tms:ValorImpostoIcmsIssqn>
                <tms:ParcelaUnica>true</tms:ParcelaUnica>
                <tms:ModoCompraValePedagio>4</tms:ModoCompraValePedagio>
                <tms:CategoriaVeiculo>11</tms:CategoriaVeiculo>
                <tms:NomeMotorista>MARCELOCAMPOS FERREIRA</tms:NomeMotorista>
                <tms:CPFMotorista>06647297626</tms:CPFMotorista>
                <tms:RNTRCMotorista>004172046</tms:RNTRCMotorista>
                <tms:ItemFinanceiro></tms:ItemFinanceiro>
                <tms:Parcelas>
                    <tms:OperacaoTransporteParcelaRequest>
                        <tms:DescricaoParcela>ADIANTAMENTO</tms:DescricaoParcela>
                        <tms:Valor>600.0</tms:Valor>
                        <tms:NumeroParcela>1</tms:NumeroParcela>
                        <tms:DataVencimento>2021-02-12</tms:DataVencimento>
                        <tms:TipoDaParcela>1</tms:TipoDaParcela>
                        <tms:FormaPagamento>2</tms:FormaPagamento>
                        <tms:CartaoPagamento></tms:CartaoPagamento>
                        <tms:CodigoBanco>341</tms:CodigoBanco>
                        <tms:AgenciaDeposito>0734</tms:AgenciaDeposito>
                        <tms:ContaDeposito>58077-2</tms:ContaDeposito>
                        <tms:DigitoContaDeposito>0</tms:DigitoContaDeposito>
                        <tms:ProcessarAutomaticamente>true</tms:ProcessarAutomaticamente>
                        <tms:IdOperacaoTransporteParcela>0</tms:IdOperacaoTransporteParcela>
                        <tms:FlagContaPoupanca>false</tms:FlagContaPoupanca>
                        <tms:VariacaoContaPoupanca></tms:VariacaoContaPoupanca>
                        <tms:ItemFinanceiroParcela></tms:ItemFinanceiroParcela>
                    </tms:OperacaoTransporteParcelaRequest>
                    <tms:OperacaoTransporteParcelaRequest>
                        <tms:DescricaoParcela>SALDO DE FRETE</tms:DescricaoParcela>
                        <tms:Valor>211.01</tms:Valor>
                        <tms:NumeroParcela>2</tms:NumeroParcela>
                        <tms:DataVencimento>2021-02-12</tms:DataVencimento>
                        <tms:TipoDaParcela>2</tms:TipoDaParcela>
                        <tms:FormaPagamento>2</tms:FormaPagamento>
                        <tms:CartaoPagamento></tms:CartaoPagamento>
                        <tms:CodigoBanco>341</tms:CodigoBanco>
                        <tms:AgenciaDeposito>0734</tms:AgenciaDeposito>
                        <tms:ContaDeposito>58077-2</tms:ContaDeposito>
                        <tms:DigitoContaDeposito>0</tms:DigitoContaDeposito>
                        <tms:ProcessarAutomaticamente>true</tms:ProcessarAutomaticamente>
                        <tms:IdOperacaoTransporteParcela>0</tms:IdOperacaoTransporteParcela>
                        <tms:FlagContaPoupanca>false</tms:FlagContaPoupanca>
                        <tms:VariacaoContaPoupanca></tms:VariacaoContaPoupanca>
                        <tms:ItemFinanceiroParcela></tms:ItemFinanceiroParcela>
                    </tms:OperacaoTransporteParcelaRequest>
                </tms:Parcelas>
                <tms:Veiculos>
                    <tms:OperacaoTransporteVeiculoRequest>
                        <tms:Placa>AXS5518</tms:Placa>
                        <tms:RNTRC>00330260</tms:RNTRC>
                    </tms:OperacaoTransporteVeiculoRequest>
                    <tms:OperacaoTransporteVeiculoRequest>
                        <tms:Placa>FFW4204</tms:Placa>
                        <tms:RNTRC>00330260</tms:RNTRC>
                    </tms:OperacaoTransporteVeiculoRequest>
                </tms:Veiculos>
                <tms:IdRotaModelo>14512</tms:IdRotaModelo>
                <tms:DeduzirImpostos>true</tms:DeduzirImpostos>
                <tms:TarifasBancarias>0.0</tms:TarifasBancarias>
                <tms:QuantidadeTarifasBancarias>0</tms:QuantidadeTarifasBancarias>
                <tms:IdIntegrador>OC.: 526 - EMP.: 2 - AFT.: 1 36582018</tms:IdIntegrador>
                <tms:ValorDescontoAntecipado>17.52</tms:ValorDescontoAntecipado>
                <tms:CPFCNPJParticipanteDestinatario>25161766000260</tms:CPFCNPJParticipanteDestinatario>
                <tms:CPFCNPJParticipanteContratante></tms:CPFCNPJParticipanteContratante>
                <tms:CPFCNPJParticipanteSubcontratante></tms:CPFCNPJParticipanteSubcontratante>
                <tms:CPFCNPJParticipanteConsignatario></tms:CPFCNPJParticipanteConsignatario>
                <tms:NumeroLacreTransporteCombustivel></tms:NumeroLacreTransporteCombustivel>
                <tms:NumeroCartaoValePedagio>0</tms:NumeroCartaoValePedagio>
                <tms:DocumentoValePedagio></tms:DocumentoValePedagio>
                <tms:CEPOrigem>18160000</tms:CEPOrigem>
                <tms:CEPDestino>36160000</tms:CEPDestino>
                <tms:TipoCargaANTT>0</tms:TipoCargaANTT>
                <tms:DistanciaPercorrida>0.0</tms:DistanciaPercorrida>
            </tms:operacao>
        </tms:CadastrarAtualizarOperacaoTransporte>
    </soapenv:Body>
</soapenv:Envelope>